<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
    <!-- base href="http://www.cg.cs.tu-bs.de/teaching/lab/ss08/teamproject/"/ -->
    <title>Teamprojekt Canyonshooter - 5.7 Konsole</title>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8">
	<link rel="stylesheet" href="../css/thickbox.css" type="text/css" media="screen" />
	<script type="text/javascript" src="../js/jquery-latest.js"></script>
	<script type="text/javascript" src="../js/thickbox.js"></script>

    <link rel="StyleSheet" href="../css/cgstyle.css" type="text/css">
</head>

<body>
	<div id="cg_body_margin">
        <table class="header" width="100%" cellspacing="0" border="0" cellpadding="0" style="border-collapse: collapse;">
            <tr>
                <td>
                    <a id="cgl" class="title" href="index.html">Computer Graphics</a>
                    <a id="uf" href="http://www.tu-braunschweig.de" class="title">TU Braunschweig</a>
                </td>
                <td align="right" width="20"></td>
            </tr>
        </table>


        <br><br>

        <!-- ************** Start of your website ****************-->

        <!-- ************** Teaser images ****************-->

        <a href="../index.html" class="footer">Canyonshooter</a>
        - 5 User Interface
        - 5.7 Konsole

        <div class="margin">
            <h2>Teamprojekt Canyonshooter</h2>

            <h3>5.7 Konsole</h3>

            <h4>Zweck der Konsole</h4>
            <p class="margin">
            	W&auml;hrend der Entwicklung des Canyonshooter stellte sich heraus, dass eine Konsole ben&ouml;tigt wurde.
            	Unter einer Konsole versteht man einen Bereich innerhalb des Spiels, in den der Benutzer Kommandos eingeben kann,
            	die dann entsprechend verarbeitet werden und gegebenenfalls eine Ausgabe produzieren.
			</p>
            <p class="margin">
            	&Uuml;ber die Konsole ist es durch das Ausf&uuml;hren von Kommandos m&ouml;glich, beliebige
            	<a href="http://de.wikipedia.org/wiki/Methode_%28Programmierung%29#Methoden">Methoden</a> innerhalb des
            	Canyonshooter auszuf&uuml;hren und <a href="http://de.wikipedia.org/wiki/Variable_%28Programmierung%29">Variablen</a>-Werte
            	zu ver&auml;ndern. G&auml;be es diese M&ouml;glichkeit nicht, so m&uuml;sste der Programmierer das Programm
            	f&uuml;r jeder &Auml;nderung zun&auml;chst beenden, die n&ouml;tige &Auml;nderung im Quelltext vornehmen und das Programm danach
            	erneut ausf&uuml;hren.
			</p>
            <p class="margin">
            	Besonders pratkisch ist diese Funktionalit&auml;t beim Balancing. Unter Balancing versteht man das Konfigurieren des
            	Spiels in der Hinsicht, dass der Spielspa&szlig des Spieler durch das Herausfinden der richtige Schwierigkeitsstufe
            	maximiert wird. Der Spieler soll sich nicht langweilen, weil er Gegner zu leicht besiegen kann und soll auch nicht
            	frustiert werden, weil er diese nie besiegen kann. Das richtige Mittelma&szlig; zu finden, ist Aufgabe des Balancing.
            	Dank der Konsole ist der Entwickler nun in der Lage, beliebige Werte zu ver&auml;ndern, w&auml;hrend er sich
            	im Spiel befindet. So kann z. B. die Spielgeschwindigkeit einfach erh&ouml;ht oder verringert werden, ohne das Programm
            	beenden und die &Auml;nderung im Quelltext vornehmen zu m&uuml;ssen.
			</p>

            <h4>Schwierigkeit & Funktionsweise</h4>
            <p class="margin">
            	Die Schwierigkeit bei der Entwicklung der Konsole bestand darin, das Einbinden beliebiger Funktionen und Variablen so
            	komfortabel wie m&ouml;glich zu gestalten. Die Eingabe der Kommandos in die Konsole findet in Textform statt. Das
            	Kommando "Renderer.DrawCollisionShapes" beispielsweise, hat zur Folge, dass eine Methode aufgerufen wird, die
            	das Zeichnen von Kollisions-Boxen zur Folge hat. Kollisions-Boxen sind dreidimensionale K&ouml;rper innerhalb
            	des Spiels, die zur Feststellung von Kollisionen zweier Objekte ben&ouml;tigt werden. Da die Objekte, z. B. ein Raumschiff,
            	in ihrer Form sehr komplex sind, umgibt man sie mit einer oder mehreren Kollisions-Boxen. Im Folgenden muss dann nicht
            	mehr das komplexe Modell des Raumschiffs auf Kollisionen mit anderen meist ebenfalls komplexen Objekten gepr&uuml;ft werden, was sehr
            	rechenintensiv ist, sondern es werden nur Kollisionen der Kollisions-Boxen untereinander gepr&uuml;ft,
            	was dem Computer eine Menge Rechenarbeit erspart.
			</p>
            <p class="margin">
            	Die Konsole muss nun daf&uuml;r sorgen, dass das Kommando korrekt interpretiert und die gew&uuml;nschte Funktion
            	auch tats&auml;chlich aufgerufen wird. Dies geschieht so, dass das Kommando zun&auml;chst aufgeteilt wird.
            	Wie man bereits erkennen kann, besteht das Kommando "Renderer.DrawCollisionShapes" aus zwei Teilen. Die Methode
            	"DrawCollisionShapes" ist Teil des Renderers und wird deshalb in dieser Form aufgerufen. Die Kommandos sind also
            	hierarchisch organisiert. Der Renderer k&ouml;nnte auch eine Menge weiterer Methoden zur Ausf&uuml;hrung
            	bereitstellen, die dann &uuml;ber Kommandos wie "Renderer.EineWeitereMethode" aufgerufen werden
            	w&uuml;rden.
			</p>
            <p class="margin">
            	Damit Methoden und Variablen innerhalb der Konsole &uuml;berhaupt benutzt werden k&ouml;nnen, m&uuml;ssen sie
            	zun&auml;chst in der Konsole registriert werden. Dies geschieht durch den Aufruf eines einfachen Befehls
            	inerhalb des Quelltexts. Dabei findet die Zuordnung des Befehls mit der Methode statt.
            	Die Registrierung der Methode "DrawCollisionShapes" z. B. ordnet diese dem Renderer zu. Die Zuordnung ist im
            	Prinzip willk&uuml;rlich und ist nur vorgesehen, damit die vielen Kommandos einigerma&szlig; &uuml;bersichtliche
            	geordnet werden k&ouml;nnen.
            	Weiterhin wird bei der Registrierung der Zusammenhang zu der Methode innerhalb des Quelltexts hergestellt,
            	denn die Konsole muss wissen, welche der vielen Methoden des gesamten Canyonshooters sie bei dem speziellen
            	Befehl "Renderer.DrawCollisionShapes" aufrufen soll.
			</p>
            <p class="margin">
            	Dank der <a href="http://de.wikipedia.org/wiki/Reflection">Reflection</a>-Technologie des
            	<a href="http://de.wikipedia.org/wiki/Microsoft">Microsoft</a>
            	<a href="http://de.wikipedia.org/wiki/.NET">.NET Frameworks</a> ist es m&ouml;glich, Methoden anhand ihres Namens
            	zu identifizieren. Dies war in der Programmierung bisher nicht selbstverst&auml;ndlich. Denn die Bezeichnung einer
            	Methode, die der Entwickler beliebig und nur zur besseren Verst&auml;ndlichkeit des Quelltexts sinnvoll aber dennoch
            	frei gew&auml;hlt hat, ist f&uuml;r die Ausf&uuml;hrung des Programms v&ouml;llig irrelevant. Den Computer interessiert
            	nicht, ob der Entwickler eine Methode "DrawCollisionShapes" oder "A938Gslewiuvkh" genannt hat.
			</p>
            <p class="margin">
            	Durch die Reflection-Technologie werden genau diese Meta-Daten, wie der Name einer Methode, zus&auml;tzlich gespeichert
            	und k&ouml;nnen zur
            	<a href="http://de.wikipedia.org/wiki/Laufzeit_%28Informatik%29">Laufzeit</a> des Programms genutzt werden.
            	Das Vorhandensein dieser Informationen und deren Nutzbarkeit wiederum erm&ouml;glichen es der Konsole,
            	relativ einfach auf die Methode zuzugreifen. W&auml;re dieser einfache Zugriff nicht m&ouml;glich, so
            	h&auml;tte der Entwickler zu jeder einzelnen Methode oder Variable, die er in der Konsole nutzen m&ouml;chte,
            	zus&auml;tzlichen Quelltext schreiben m&uuml;ssen.
			</p>
            <p class="margin">
				Dank der Reflection-Technologie muss der Programmierer also w&auml;hrend der Entwicklung seines Quelltexts keine
				R&uuml;cksicht auf das Vorhandensein der Konsole nehmen. Er muss keine speziellen Regeln befolgen, damit seine
				Methoden und Variablen von der Konsole nutzbar sind, was bei der Entwicklung ein sehr gro&szlig;er Vorteil ist.
            </p>



            <h4>Grafisches Interface</h4>
            <p class="margin">
				Die Implementierte Konsole umfasst zwei Teilkonsolen.
				Die Debug-Konsole ist f&uuml;r Entwicklungszwecke gedacht und im Spiel ersteinmal garnicht sichtbar. Per "^"-Taste kann
				man die Debug-Konsole aufrufen um Informationen abzurufen oder Daten im Spiel zu ver&auml;ndern. Die Darstellung der
				Konsole umfasst eine "History" (&auml;hnlich DOS), die mit BILD-AUF und BILD-AB durchlaufen werden kann und eine Eingabezeile,
				in der man den gerade eingetippten Befehl, sowie einige ausw&auml;hlbare Vorschl&auml;ge zur vervollst&auml;ndigung des
				Befehls bekommt. Zus&auml;tzlich kann jeder Teil des gesammten Spieles auf die Debug-Konsole zugreifen um
				umfangreiche Informationen &uuml;ber Fehler oder andere Informationen verf&uuml;gbar zu machen.
				Die Ingame-Konsole ist f&uuml;r Informationen gedacht, die dem Spieler unmittelbar zur Verf&uuml;gung gestellt werden
				soll. Die Ingame-Konsole befindet sich am oberen linken Teil des Bildschirms und umfasst nur einige Zeilen. In diesen
				Zeilen k&ouml;nnen (von jedem Teil des Spieles) Information ausgegeben werden wie etwa Schadensmeldungen,
				aufgesammelte Gegenst&auml;nde oder drohende Gefahren.
			</p>


			<h3>Das aktuelle Kapitel</h3>
            <ul class="content_dir">
                <li> <a href="../index.html">Inhaltsverzeichnis</a>
                    <ul class="content_dir">
                        <li> 5 User Interface
                            <ul class="content_dir">
                                <li> <a href="menu.html">5.1 Men&uuml;</a> </li>
                                <li> <a href="profile.html">5.2 Profile</a> </li>
                                <li> <a href="modellauswahl.html">5.3 Modellauswahl</a> </li>
                                <li> <a href="highscore.html">5.4 Highscore</a> </li>
                                <li> <a href="credits.html">5.5 Credits</a> </li>
                                <li> <a href="hud.html">5.6 HUD</a> </li>
                                <li> <b>5.7 Konsole</b> </li>
                            </ul>
                        </li>
                    </ul>
                </li>
            </ul>

        </div>

        <!-- ************** End of your website ****************-->
        <br>
        <br>

        <p id="bottom">
            <br>
            <a href="http://www.tu-braunschweig.de" class="footer">TU Braunschweig</a>
            - <a href="http://www.cs.tu-bs.de" class="footer">Fakult&auml;t f&uuml;r Mathematik und Informatik</a>
            - <a href="http://www.cg.cs.tu-bs.de/index.html" class="footer">Computer Graphics</a> - Teamprojekt Canyonshooter
        </p>
    </div>
</body>
</html>
