<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
    <!-- base href="http://www.cg.cs.tu-bs.de/teaching/lab/ss08/teamproject/"/ -->
    <title>Teamprojekt Canyonshooter - 5.1 Men&uuml;</title>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8">
	<link rel="stylesheet" href="../css/thickbox.css" type="text/css" media="screen" />
	<script type="text/javascript" src="../js/jquery-latest.js"></script>
	<script type="text/javascript" src="../js/thickbox.js"></script>

    <link rel="StyleSheet" href="../css/cgstyle.css" type="text/css">
</head>

<body>
	<div id="cg_body_margin">
        <table class="header" width="100%" cellspacing="0" border="0" cellpadding="0" style="border-collapse: collapse;">
            <tr>
                <td>
                    <a id="cgl" class="title" href="index.html">Computer Graphics</a>
                    <a id="uf" href="http://www.tu-braunschweig.de" class="title">TU Braunschweig</a>
                </td>
                <td align="right" width="20"></td>
            </tr>
        </table>

        <br><br>

        <!-- ************** Start of your website ****************-->

        <!-- ************** Teaser images ****************-->

        <a href="../index.html" class="footer">Canyonshooter</a>
        - 5 User Interface
        - 5.1 Men&uuml;

        <div class="margin">
            <h2>Teamprojekt Canyonshooter</h2>

            <h3>5.1 Men&uuml;</h3>
            <h4>Aufbau des Men&uuml;s</h4>

            <table class="figures" style="float: right">
                <tr>
                    <td align="center">
                        <a href="pics/menu.jpg" class="thickbox" rel="menu" Title="(a) Hauptmen&uuml;">
                            <img src="pics/menu_small.jpg" alt="(a) Hauptmen&uuml;">
                        </a>
                    </td>
                </tr>
                <tr>
                    <td align="center"> (a) Hauptmen&uuml;</td>
                </tr>
            </table>


            <p class="margin">
                Das Men&uuml; stellt den wesentlichen Bereich des Spiels dar, der die einzelnen nutzbaren Module des Spiels miteinander
                verbindet und dem Nutzer die Interaktion mit den Modulen au&szlig;erhalb der eigentlichen Spielwelt erm&ouml;glicht.
                So bekommt der Nutzer die M&ouml;glichkeit, &uuml;ber verschiedene Dialoge Einstellungen zur Steuerung vorzunehmen oder 
                einen Gleiter auszuw&auml;hlen. &Uuml;ber das Highscoremen&uuml; kann er 
                seine bisher erreichten Punkt einzusehen.
            </p>

            <p class="margin">
                Das Men&uuml; besteht aus den folgenden Teilen:
            </p>
            <ul class="normallist">
                <li> <a href="#hauptmenu">Hauptmen&uuml;</a> </li>
                <li> <a href="#optionsmenu">Optionsmen&uuml;</a> </li>
                <li> <a href="#highscoremenu">Highscoremen&uuml;</a> </li>
                <li> <a href="modellauswahl.html">Gleiterwahl</a> </li>
                <li> <a href="profile.html">Profil</a> </li>
            </ul>

            <h5 id="hauptmenu">Hauptmen&uuml;</h5>
            <p class="margin">
                Nach dem Vorspann gelangt der Benutzer ins Hauptmen&uuml;, von wo aus er direkt ins Spiel einsteigen kann oder in
                die weiteren Untermen&uuml;s f&uuml;r <a href="#optionsmenu">Optionen</a>, <a href="#highscoremenu">Highscore</a> 
                und <a href="modellauswahl.html">Gleiterwahl</a> wechseln kann.
            </p>

            <h5 id="optionsmenu">Optionsmen&uuml;</h5>
            <table class="figures" style="float: right">
                <tr>
                    <td align="center">
                        <a href="pics/menus.jpg" class="thickbox" rel="menu" Title="(b) Men&uuml;s">
                            <img src="pics/menus_small.jpg" alt="(b) Men&uuml;s">
                        </a>
                    </td>
                </tr>
                <tr>
                    <td align="center"> (b) Men&uuml;s</td>
                </tr>
            </table>

            <p class="margin">
                Im Optionsmen&uuml; kann der Spieler &Auml;nderungen bez&uuml;glich
            </p>
            <ul class="normallist">
                <li> seiner Identit&auml;t, </li>
                <li> den graphischen Einstellungen, </li>
                <li> der Steuerung </li>
            </ul>
            <p class="margin">
                vornehmen, sodass er das Spiel an seine pers&ouml;nlichen Bed&uuml;rfnissen anpassen kann. Dar&uuml;ber hinaus gelangt der
                Benutzer &uuml;ber das Optionsmen&uuml; auch in das Men&uuml; f&uuml;r <a href="profile.html">Profile</a>.
            </p>


            <h5 id="highscoremenu">Highscoremen&uuml;</h5>
            <p class="margin">
                Im Highscoremen&uuml; kann der Nutzer seine bisherigen Leistungen und die der anderen Nutzer betrachten.
                Dabei werden die erbrachten Leistungen in drei Schwierigkeitsstufen eingeteilt und sind in einzeln sortierten Listen
                einsehbar.
            </p>


            <h4>Programmtechnische Struktur des Men&uuml;s</h4>

            <table class="figures" style="float: right">
                <tr>
                    <td align="center">
                        <a href="pics/buttontolist.jpg" class="thickbox" rel="menu" Title="(c) ButtonList UML Klassendiagramm">
                            <img src="pics/buttontolist_small.jpg" alt="(c) ButtonList UML Klassendiagramm">
                        </a>
                    </td>
                </tr>
                <tr>
                    <td align="center"> (c) ButtonList UML Klassendiagramm </td>
                </tr>
            </table>

            <p class="margin">
                Der Hauptbestandteil des Men&uuml;s sind die Buttons, die durch den Benutzer aktiviert werden und daraufhin die ihnen 
                zugeordnete Aktion ausf&uuml;hren. Die Buttons verweisen auf Untermen&uuml;s oder spezielle Interaktionsmen&uuml;s,
                in denen Daten eingesehen oder ge&auml;ndert werden k&ouml;nnen. Ein Button besitzt im Normalfall zwei Zust&auml;nde
                (aktiv/inaktiv), denen jeweils eine Grafik zu Darstellung des Buttons zugeordnet ist.
            </p>
            <p class="margin">
                Zur einfacheren Ansteuerung dieser Buttons mittels Maus oder Keyboard werden die Buttons eines Men&uuml;s in einer
                ButtonList gruppiert. Die ButtonList basiert auf einer LinkedList und verbindet aufeinander folgende Buttons miteinander,
                sowie rekursiv den Ersten und Letzten der Liste. Diese Liste l&auml;sst sich dann horizontal oder vertikal auf den
                Bildschirm ausgeben.
            </p>

            <p class="margin">
                Das Hauptmen&uuml; sowie die beiden Zwischenmen&uuml;s, Optionsmen&uuml; und Highscoremen&uuml;, basieren auf
                einer Mainlist, einer Spezialisierung der ButtonList mit &auml;hnlichen Grafiken und Strukturen. Genau genommen
                werden die einzelnen Zwischenmen&uuml;s nur in die Liste eingeladen. Die n&ouml;tigen Daten f&uuml;r das Zwischenmen&uuml;
                und die darin enthaltenden Buttons werden aus einer XML-Datei ausgelesen. Neben dem Hauptmen&uuml; und den beiden
                Zwischenmen&uuml;s gibt es weiterhin Men&uuml;abschnitte mit Nutzerinteraktion. Diese Abschnitte verwenden
                weitere spezielle Komponenten, die wieder auf die Spezialisierungen der ButtonList zur&uuml;ckgreifen. So arbeiten
                sowohl die scrollbare Listbox als auch der statische Dialog in Abstimmung mit ihrer jeweiligen Umgebung
                mit diesen Spezialisierungen. So kommt unter Optionen eine spezielle ButtonList (OptionList) im Zusammenhang mit
                der Ver&auml;nderung der Einstellungen zum Zuge, w&auml;hrend f&uuml;r die Anzeige des Highscores eine auf
                den Highscore abgestimmte HighscoreList zum Einsatz kommt.
            </p>

            <h5>Listbox</h5>

            <p class="margin">
                Die Listbox kommt sowohl im Highscoremen&uuml; zum Einsatz um die Leistungen der Nutzer darzustellen, als auch im
                Optionsmen&uuml;, wo sie die &Auml;nderung der Steuerung erm&ouml;glicht. Die Listbox besteht aus einer Grafik f&uuml;r
                die Umrandung der Box, sowie zwei ButtonLists zur Interaktion. Die erste ButtonList ist immer eine Spezialisierung, die
                auf den Einsatzzweck angepasst ist. So kommt unter Optionen die OptionList zum Einsatz, w&auml;hrend unter Highscore
                die HighscoreList genutzt wird. In beiden F&auml;llen werden wieder die n&ouml;tigen Daten zu Erstellung der Liste
                aus einer speziellen XML-Datei ausgelesen.
            </p>

            <p class="margin">
                Die zweite ButtonList ist eine Normallist, mit der generelle Buttons, wie Annehmen und Ablehnen, zur Best&auml;tigung
                und Beendigung der Interaktion und der R&uuml;ckkehr in die Zwischenmen&uuml;s eingebunden werden.
            </p>

            <p class="margin">
                Dar&uuml;ber hinaus verf&uuml;gt die Listbox &uuml;ber eine Scrollbar, mit der es m&ouml;glich ist, 
                mit der Maus durch die einzelnen Eintr&auml;ge zu scrollen. Die Scrollbar besteht aus zwei Buttons, jeweils
                einer am oberen und unterm Ende, zum
                punktuellen Scrollen. Die aktuelle Scrollposition wird &uuml;ber einen Balken dargestellt, dessen
                Gr&ouml;&szlig;e dem Gr&ouml;&szlig;enverh&auml;ltnis der gesamten scrollbaren Elemente zu den sichtbaren entspricht.
            </p>

            <table class="figures">
                <tr>
                    <td align="center">
                        <a href="pics/steuerung.jpg" class="thickbox" rel="menu" Title="(d) Steuerung">
                            <img src="pics/steuerung_small.jpg" alt="(d) Steuerung">
                        </a>
                    </td>
                    <td align="center">
                        <a href="pics/hs1.jpg" class="thickbox" rel="menu" Title="(e) Highscore">
                            <img src="pics/hs1_small.jpg" alt="(e) Highscore">
                        </a>
                    </td>
                </tr>
                <tr>
                    <td align="center"> (d) Steuerung </td>
                    <td align="center"> (e) Highscore </td>
                </tr>
            </table>

            <h5>Dialog</h5>


            <p class="margin">
                Der Dialog tritt nur im Rahmen der Einstellungen der Grafik, des Sounds und der Spielereinstellungen unter
                Optionen auf. Er ist im Gegensatz zur Listbox nur statisch und bietet nicht die M&ouml;glichkeit die dargestellten
                Inhalte zu scrollen.
            </p>

            <p class="margin">
                Auch dieser Dialog nutzt eine Spezialisierung der ButtonList als Grundlage. Zum Einsatz kommt auch hier die auf die
                Optionen abgestimmte OptionList. Im Gegensatz zur Listbox wird beim Dialog nur eine ButtonList genutzt, welche jedoch
                wieder aus einer speziellen XML-Datei ausgelesen wird. Die Buttons zum Beenden der Interaktion sind hier fest in die
                Struktur positioniert und werden in keiner ButtonList gruppiert.
            </p>

            <table class="figures">
                <tr>
                    <td align="center">
                        <a href="pics/optsound.jpg" class="thickbox" rel="menu" Title="(f) Soundoptionen">
                            <img src="pics/optsound_small.jpg" alt="(f) Soundoptionen">
                        </a>
                    </td>
                    <td align="center">
                        <a href="pics/list.jpg" class="thickbox" rel="menu" Title="(g) UML Klassendiagramm der verschiedenen Listen">
                            <img src="pics/list_small.jpg" alt="(g) UML Klassendiagramm der verschiedenen Listen">
                        </a>
                    </td>
                </tr>
                <tr>
                    <td align="center"> (f) Soundoptionen </td>
                    <td align="center"> (g) UML Klassendiagramm der verschiedenen Listen </td>
                </tr>
            </table>

            <h4>Elemente zu Interaktion</h4>
            <p class="margin">
                Die Buttons sind nicht die einzigen Elemente mit denen der Nutzer im Men&uuml; interagiert.
            </p>

            <h5>Prompt</h5>
            <p class="margin">
                Der Prompt ist das &auml;quivalent zur Fehlermeldung unter Windows. Er l&auml;sst sich von jedem anderem Objekt
                aufrufen, zumeist durch Buttons, und zeigt dem Nutzer eine Meldung auf dem Bildschirm. Dar&uuml;ber hinaus bietet er
                dem Nutzer zwei integrierte Buttons zur Interaktion. Die Buttons k&ouml;nnen frei in ihrer Funktionsweise belegt werden
                - am h&auml;ufigsten jedoch sind Annehmen und Abbrechen.
            </p>

            <p class="margin">
                Somit kommt der Prompt auch in unterschiedlichen Umgebungen zum Einsatz. Zum einen kann er den Nutzer auf ein
                Problem hinweisen, als auch eine get&auml;tigte Eingabe von ihm best&auml;tigen lassen, sowie eine Interaktion,
                wie das L&ouml;schen der Highscore, initiieren und durch Best&auml;tigung des Nutzers ausf&uuml;hren.
            </p>
            <p class="margin">
                Dar&uuml;ber hinaus besitzt der Prompt noch die M&ouml;glichkeit eine Eingabe vom Nutzer abzufragen, womit sich auch
                Eingaben f&uuml;r Namen oder Tastenbelegungen mit dem Prompt nutzerfreundlich realisieren lassen. Der Prompt ist vor
                allem geeignet um den Nutzer vor unwiderruflichen Eingaben und Interaktionen zu warnen und dessen bewusste
                Best&auml;tigung zu verlangen.
            </p>

            <table class="figures">
                <tr>
                    <td align="center">
                        <a href="pics/promptover.jpg" class="thickbox" rel="menu" Title="(h) Prompt">
                            <img src="pics/promptover_small.jpg" alt="(h) Prompt">
                        </a>
                    </td>
                    <td align="center">
                        <a href="pics/prompts.jpg" class="thickbox" rel="menu" Title="(i) Prompts">
                            <img src="pics/prompts_small.jpg" alt="(i) Prompts">
                        </a>
                    </td>
                </tr>
                <tr>
                    <td align="center"> (h) Prompt </td>
                    <td align="center"> (i) Prompts </td>
                </tr>
            </table>

            <h5>HSlideBar</h5>
            <p class="margin">
                Bei der HSlideBar handelt es sich fast um einen horizontalen Scrollbar. Die HSlideBar besteht aus zwei Buttons, an jedem
                Ende einer, und einer Leiste mit einem Marker. Mit den beiden Buttons l&auml;sst sich nun die Position des
                Markers auf der Leiste in die jeweilige Richtung ver&auml;ndern. Auch ein Klick mit der Maus auf die Leiste positioniert
                den Marker an dieser Stelle.
            </p>

            <table class="figures">
                <tr>
                	<td align="center">
                        <a href="pics/hslidebar.jpg" class="thickbox" rel="menu" Title="(j) HSlideBar">
                            <img src="pics/hslidebar.jpg" alt="(j) HSlideBar">
                        </a>
                    </td>
                </tr>
                <tr>
                    <td align="center"> (j) HSlideBar </td>
                </tr>
            </table>

            <p class="margin">
                Der Marker gibt dabei immer einen Wert an, der dem Umfeld zugeordnet wird. Dabei stellt das linke Ende der Leiste immer
                den Minimalwert dar, w&auml;hrend das rechte Ende immer den Maximalwert wiedergibt. Die Position des Marker bestimmt nun
                einen Wert zwischen diesen beiden Werten und gibt diesen weiter. Mit dem HSlideBar lassen sich so einfach Einstellungen
                wie f&uuml;r die Lautst&auml;rke von Musik oder Effekten einfach und nutzerfreundlich einstellen.
            </p>

            <h5>Anmerkung</h5>
                Dieser komplexe Aufbau und die eigene Erstellung der einzelnen Komponenten sind aufgrund des 
                <a href="http://de.wikipedia.org/wiki/Microsoft">Microsoft</a> 
                <a href="http://de.wikipedia.org/wiki/XNA_%28Microsoft%29">XNA Frameworks</a> 
                notwendig gewesen, da dieses Framework keine vorgefertigten GUI Elemente bietet und es mit
                ihm auch nicht  m&ouml;glich ist, auf bereits vorhandene GUI Elemente aus anderen Frameworks oder API zur&uuml;ckzugreifen.
            </p>

            <h4>Men&uuml;steuerung</h4>
            <p class="margin">
            	Die Steuerung des Hauptmen&uuml;s sowie allen Untermen&uuml;s ist per Tastatur und/oder Maus statt.
            	Selbes gilt f&uuml;r die Einstellungsm&ouml;glichkeiten in den Optionen. So kann der Benutzer 
            	seine pers&ouml;nlich bevorzugte Steuerungsart w&auml;hlen und nutzen.
            </p>


            <h3>Das aktuelle Kapitel</h3>
            <ul class="content_dir">
                <li> <a href="../index.html">Inhaltsverzeichnis</a>
                    <ul class="content_dir">
                        <li> 5 User Interface
                            <ul class="content_dir">
                                <li> <b>5.1 Men&uuml;</b> </li>
                                <li> <a href="profile.html">5.2 Profile</a> </li>
                                <li> <a href="modellauswahl.html">5.3 Modellauswahl</a> </li>
                                <li> <a href="highscore.html">5.4 Highscore</a> </li>
                                <li> <a href="credits.html">5.5 Credits</a> </li>
                                <li> <a href="hud.html">5.6 HUD</a> </li>
                                <li> <a href="konsole.html">5.7 Konsole</a> </li>
                            </ul>
                        </li>
                    </ul>
                </li>
            </ul>

        </div>

        <!-- ************** End of your website ****************-->
        <br>
        <br>

        <p id="bottom">
            <br>
            <a href="http://www.tu-braunschweig.de" class="footer">TU Braunschweig</a>
            - <a href="http://www.cs.tu-bs.de" class="footer">Fakult&auml;t f&uuml;r Mathematik und Informatik</a>
            - <a href="http://www.cg.cs.tu-bs.de/index.html" class="footer">Computer Graphics</a> - Teamprojekt Canyonshooter
        </p>
    </div>
</body>
</html>
